SundeaSong/stm32-mini-cnc/GCode/stepper.c
/*
  stepper.c - stepper motor driver: executes motion plans using stepper motors
  Part of Grbl

  Copyright (c) 2009-2011 Simen Svale Skogsrud
  Copyright (c) 2011-2012 Sungeun K. Jeon
  
  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

/* The timer calculations of this module informed by the 'RepRap cartesian firmware' by Zack Smith
   and Philipp Tiefenbacher. */

#include "STM32F10x.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "misc.h"
#include "stepper.h"
#include "Grbl_config.h"
#include "settings.h"
#include "planner.h"
#include <stdint.h>
#include "cnc.h"
#
unsigned long pixcount =0;

long int x_pos=0;
long int y_pos=0;
long int z_pos=0;

//#define F_CPU 4000000L
#define F_CPU 4000000L
// Some useful constants
#define TICKS_PER_MICROSECOND (F_CPU/1000000)
#define CYCLES_PER_ACCELERATION_TICK ((TICKS_PER_MICROSECOND*1000000)/ACCELERATION_TICKS_PER_SECOND)

// Stepper state variable. Contains running data and trapezoid variables.
char ShowPos = 0;
stepper_t st;
static block_t *current_block;  // A pointer to the block currently being traced

// Used by the stepper driver interrupt
//static uint8_t step_pulse_time; // Step pulse reset time after step rise
static uint8_t out_bits;        // The next stepping-bits to be output
static volatile uint8_t busy;   // True when SIG_OUTPUT_COMPARE1A is being serviced. Used to avoid retriggering that handler.

#if STEP_PULSE_DELAY > 0
  static uint8_t step_bits;  // Stores out_bits output to complete the step pulse delay
#endif

//         __________________________
//        /|                        |\     _________________         ^
//       / |                        | \   /|               |\        |
//      /  |                        |  \ / |               | \       s
//     /   |                        |   |  |               |  \      p
//    /    |                        |   |  |               |   \     e
//   +-----+------------------------+---+--+---------------+----+    e
//   |               BLOCK 1            |      BLOCK 2          |    d
//
//                           time ----->
// 
//  The trapezoid is the shape the speed curve over time. It starts at block->initial_rate, accelerates by block->rate_delta
//  during the first block->accelerate_until step_events_completed, then keeps going at constant speed until 
//  step_events_completed reaches block->decelerate_after after which it decelerates until the trapezoid generator is reset.
//  The slope of acceleration is always +/- block->rate_delta and is applied at a constant rate following the midpoint rule
//  by the trapezoid generator, which is called ACCELERATION_TICKS_PER_SECOND times per second.

static void set_step_events_per_minute(uint32_t steps_per_minute);

// Stepper state initialization. Cycle should only start if the st.cycle_start flag is
// enabled. Startup init and limits call this function but shouldn't start the cycle.
void st_wake_up() 
{
  // Enable steppers by resetting the stepper disable port
	MotorsEnable(0x07);
  if (sys.state == STATE_CYCLE) {
    // Initialize stepper output bits
    out_bits = (0) ^ (settings.invert_mask); 
    // Initialize step pulse timing from settings. Here to ensure updating after re-writing.
      // Set step pulse time. Ad hoc computation from oscilloscope. Uses two's complement.
		
//    step_pulse_time = -(((settings.pulse_microseconds-2)*TICKS_PER_MICROSECOND) >> 3);		//snil
		
    // Enable stepper driver interrupt
    NVIC_EnableIRQ (TIM2_IRQn);  
		NVIC_SetPriority(TIM2_IRQn, 0);
		ShowPos = 1;
  }
}

// Stepper shutdown
void st_go_idle() 
{
  // Disable stepper driver interrupt
	printpos_grbl(0,480);
	ShowPos = 0;
  NVIC_DisableIRQ (TIM2_IRQn); 
//	beep(10);
  // Disable steppers only upon system alarm activated or by user setting to not be kept enabled.
  if ((settings.stepper_idle_lock_time != 0xff) || bit_istrue(sys.execute,EXEC_ALARM)) {
    // Force stepper dwell to lock axes for a defined amount of time to ensure the axes come to a complete
    // stop and not drift from residual inertial forces at the end of the last movement.
    _delay_ms(settings.stepper_idle_lock_time);
    if (bit_istrue(settings.flags,BITFLAG_INVERT_ST_ENABLE)) 
		{ 
//      STEPPERS_DISABLE_PORT &= ~(1<<STEPPERS_DISABLE_BIT); //snail
    } 
		else 
		{ 
 //     STEPPERS_DISABLE_PORT |= (1<<STEPPERS_DISABLE_BIT); 
    }   
  }
//	DebugPf("\r\n");
}

// This function determines an acceleration velocity change every CYCLES_PER_ACCELERATION_TICK by
// keeping track of the number of elapsed cycles during a de/ac-celeration. The code assumes that 
// step_events occur significantly more often than the acceleration velocity iterations.
static uint8_t iterate_trapezoid_cycle_counter() 
{
  st.trapezoid_tick_cycle_counter += st.cycles_per_step_event;  
  if(st.trapezoid_tick_cycle_counter > CYCLES_PER_ACCELERATION_TICK) {
    st.trapezoid_tick_cycle_counter -= CYCLES_PER_ACCELERATION_TICK;
    return(true);
  } else {
    return(false);
  }
}          

// "The Stepper Driver Interrupt" - This timer interrupt is the workhorse of Grbl. It is executed at the rate set with
// config_step_timer. It pops blocks from the block_buffer and executes them by pulsing the stepper pins appropriately. 
// It is supported by The Stepper Port Reset Interrupt which it uses to reset the stepper port after each pulse. 
// The bresenham line tracer algorithm controls all three stepper outputs simultaneously with these two interrupts.
//void DoOutPort(char out, char cmd)
//{
//	static char LastPort;
//	if(cmd & 0x01)	//	Nastavit smer
//	{
//		if(out & 0x20)	MOTOR1_RIGHT;
//		else		MOTOR1_LEFT;
//		if(ReverseY)
//		{
//			if(out & 0x40)	MOTOR2_RIGHT;
//			else		MOTOR2_LEFT;
//		}else
//		{
//			if(out & 0x40)	MOTOR2_LEFT;
//			else		MOTOR2_RIGHT;
//		}
//		if(out & 0x80)	MOTOR3_DOWN;
//		else		MOTOR3_UP;
//		if((LastPort & 0xE0) != (out & 0xE0))	//	Ak doslo k zmene smeru !!!
//			_delay_us(5);
//		LastPort = out;
//	}
//	if(cmd & 0x02)	//	Nastavit pohyb
//	{
//		if(out & 0x04)	
//		{
//			MOTOR1_PLUSE_L;
//			if(out & 0x20)	x_pos--;
//			else x_pos++;
//		}else		
//			MOTOR1_PLUSE_H; 
//		
//		if(out & 0x08)	
//		{
//			MOTOR2_PLUSE_L;
//			if(out & 0x40)	y_pos--;
//			else y_pos++;
//		}	else		
//			MOTOR2_PLUSE_H;
//		if(out & 0x10)	
//		{
//			MOTOR3_PLUSE_L;
//			if(out & 0x80)	z_pos--;
//			else z_pos++;
//		}
//		else		
//			MOTOR3_PLUSE_H;
//	}
//}
void TIM2_IRQHandler(void)
{
	static char pin_h = 1;
	
  if ((TIM2->SR & 0x0001) != 0)                  // check interrupt source
	{
    TIM2->SR &= ~(1<<0);                          // clear UIF flag
		TIM2->CNT = 0;
		
		if(pin_h == 0)
		{
			pin_h++;	
			// Set the direction pins a couple of nanoseconds before we step the steppers			
			OutputControl((STEPPING_PORT & ~STEP_MASK) | 0x00);	//	na piny poslem pohyb
		//	TIM4->CNT = 0;
		//	TIM4->CR1 |= (1<<0); 
			busy = true;
			// Re-enable interrupts to allow ISR_TIMER2_OVERFLOW to trigger on-time and allow serial communications
			// regardless of time in this handler. The following code prepares the stepper driver for the next
			// step interrupt compare and will always finish before returning to the main program.
			// If there is no current block, attempt to pop one from the buffer
			if (current_block == NULL) {// Anything in the buffer? If so, initialize next motion.
				current_block = plan_get_current_block();
				if (current_block != NULL) {
					if (sys.state == STATE_CYCLE) {// During feed hold, do not update rate and trap counter. Keep decelerating.
						st.trapezoid_adjusted_rate = current_block->initial_rate;
						set_step_events_per_minute(st.trapezoid_adjusted_rate); // Initialize cycles_per_step_event
						st.trapezoid_tick_cycle_counter = CYCLES_PER_ACCELERATION_TICK/2; // Start halfway for midpoint rule.
					}
					st.min_safe_rate = current_block->rate_delta + (current_block->rate_delta >> 1); // 1.5 x rate_delta
					st.counter_x = -(current_block->step_event_count >> 1);
					st.counter_y = st.counter_x;
					st.counter_z = st.counter_x;
					st.event_count = current_block->step_event_count;
					st.step_events_completed = 0;     
				} else {
					st_go_idle();
					bit_true(sys.execute,EXEC_CYCLE_STOP); // Flag main program for cycle end
				}    
			} 

			if (current_block != NULL) {
				// Execute step displacement profile by bresenham line algorithm
				out_bits = current_block->direction_bits;
				st.counter_x += current_block->steps_x;
				if (st.counter_x > 0) {
					out_bits |= (1<<X_STEP_BIT);
					st.counter_x -= st.event_count;
					if (out_bits & (1<<X_DIRECTION_BIT)) { sys.position[X_AXIS]--; }
					else { sys.position[X_AXIS]++; }
				}
				st.counter_y += current_block->steps_y;
				if (st.counter_y > 0) {
					out_bits |= (1<<Y_STEP_BIT);
					st.counter_y -= st.event_count;
					if (out_bits & (1<<Y_DIRECTION_BIT)) { sys.position[Y_AXIS]--; }
					else { sys.position[Y_AXIS]++; }
				}
				st.counter_z += current_block->steps_z;
				if (st.counter_z > 0) {
					out_bits |= (1<<Z_STEP_BIT);
					st.counter_z -= st.event_count;
					if (out_bits & (1<<Z_DIRECTION_BIT)) { sys.position[Z_AXIS]--; }
					else { sys.position[Z_AXIS]++; }
				}
				st.step_events_completed++; // Iterate step events

				// While in block steps, check for de/ac-celeration events and execute them accordingly.
				if (st.step_events_completed < current_block->step_event_count) {
					if (sys.state == STATE_HOLD) {
						// Check for and execute feed hold by enforcing a steady deceleration from the moment of 
						// execution. The rate of deceleration is limited by rate_delta and will never decelerate
						// faster or slower than in normal operation. If the distance required for the feed hold 
						// deceleration spans more than one block, the initial rate of the following blocks are not
						// updated and deceleration is continued according to their corresponding rate_delta.
						// NOTE: The trapezoid tick cycle counter is not updated intentionally. This ensures that 
						// the deceleration is smooth regardless of where the feed hold is initiated and if the
						// deceleration distance spans multiple blocks.
						if ( iterate_trapezoid_cycle_counter() ) {                    
							// If deceleration complete, set system flags and shutdown steppers.
							if (st.trapezoid_adjusted_rate <= current_block->rate_delta) {
								// Just go idle. Do not NULL current block. The bresenham algorithm variables must
								// remain intact to ensure the stepper path is exactly the same. Feed hold is still
								// active and is released after the buffer has been reinitialized.
								st_go_idle();
								bit_true(sys.execute,EXEC_CYCLE_STOP); // Flag main program that feed hold is complete.
							} else {
								st.trapezoid_adjusted_rate -= current_block->rate_delta;
								set_step_events_per_minute(st.trapezoid_adjusted_rate);
							}      
						}
						
					} else {
						// The trapezoid generator always checks step event location to ensure de/ac-celerations are 
						// executed and terminated at exactly the right time. This helps prevent over/under-shooting
						// the target position and speed. 
						// NOTE: By increasing the ACCELERATION_TICKS_PER_SECOND in config.h, the resolution of the 
						// discrete velocity changes increase and accuracy can increase as well to a point. Numerical 
						// round-off errors can effect this, if set too high. This is important to note if a user has 
						// very high acceleration and/or feedrate requirements for their machine.
						if (st.step_events_completed < current_block->accelerate_until) {
							// Iterate cycle counter and check if speeds need to be increased.
							if ( iterate_trapezoid_cycle_counter() ) {
								st.trapezoid_adjusted_rate += current_block->rate_delta;
								if (st.trapezoid_adjusted_rate >= current_block->nominal_rate) {
									// Reached nominal rate a little early. Cruise at nominal rate until decelerate_after.
									st.trapezoid_adjusted_rate = current_block->nominal_rate;
								}
								set_step_events_per_minute(st.trapezoid_adjusted_rate);
							}
						} else if (st.step_events_completed >= current_block->decelerate_after) {
							// Reset trapezoid tick cycle counter to make sure that the deceleration is performed the
							// same every time. Reset to CYCLES_PER_ACCELERATION_TICK/2 to follow the midpoint rule for
							// an accurate approximation of the deceleration curve. For triangle profiles, down count
							// from current cycle counter to ensure exact deceleration curve.
							if (st.step_events_completed == current_block-> decelerate_after) {
								if (st.trapezoid_adjusted_rate == current_block->nominal_rate) {
									st.trapezoid_tick_cycle_counter = CYCLES_PER_ACCELERATION_TICK/2; // Trapezoid profile
								} else {  
									st.trapezoid_tick_cycle_counter = CYCLES_PER_ACCELERATION_TICK-st.trapezoid_tick_cycle_counter; // Triangle profile
								}
							} else {
								// Iterate cycle counter and check if speeds need to be reduced.
								if ( iterate_trapezoid_cycle_counter() ) {  
									// NOTE: We will only do a full speed reduction if the result is more than the minimum safe 
									// rate, initialized in trapezoid reset as 1.5 x rate_delta. Otherwise, reduce the speed by
									// half increments until finished. The half increments are guaranteed not to exceed the 
									// CNC acceleration limits, because they will never be greater than rate_delta. This catches
									// small errors that might leave steps hanging after the last trapezoid tick or a very slow
									// step rate at the end of a full stop deceleration in certain situations. The half rate 
									// reductions should only be called once or twice per block and create a nice smooth 
									// end deceleration.
									if (st.trapezoid_adjusted_rate > st.min_safe_rate) {
										st.trapezoid_adjusted_rate -= current_block->rate_delta;
									} else {
										st.trapezoid_adjusted_rate >>= 1; // Bit shift divide by 2
									}
									if (st.trapezoid_adjusted_rate < current_block->final_rate) {
										// Reached final rate a little early. Cruise to end of block at final rate.
										st.trapezoid_adjusted_rate = current_block->final_rate;
									}
									set_step_events_per_minute(st.trapezoid_adjusted_rate);
								}
							}
						} else {
							// No accelerations. Make sure we cruise exactly at the nominal rate.
							if (st.trapezoid_adjusted_rate != current_block->nominal_rate) {
								st.trapezoid_adjusted_rate = current_block->nominal_rate;
								set_step_events_per_minute(st.trapezoid_adjusted_rate);
							}
						}
					}            
				} else {   
					// If current block is finished, reset pointer 
					current_block = NULL;
					plan_discard_current_block();
				}
			}
			out_bits ^= settings.invert_mask;  // Apply step and direction invert mask    
			busy = false;
		}	
		else if(pin_h != 0)
		{	
			OutputControl((STEPPING_PORT & ~DIRECTION_MASK) | (out_bits & DIRECTION_MASK));			
			// Then pulse the stepping pins
		//	DoOutPort(out_bits,0x02);	//	na piny poslem pohyb
			OutputControl((STEPPING_PORT & ~STEP_MASK) | out_bits);
			pin_h = 0;
		}		
	}
}

// This interrupt is set up by ISR_TIMER1_COMPAREA when it sets the motor port bits. It resets
// the motor port after a short period (settings.pulse_microseconds) completing one step cycle.
// NOTE: Interrupt collisions between the serial and stepper interrupts can cause delays by
// a few microseconds, if they execute right before one another. Not a big deal, but can
// cause issues at high step rates if another high frequency asynchronous interrupt is 
// added to Grbl.
/*
void TIM4_IRQHandler(void)
{
  if ((TIM4->SR & 0x0001) != 0)                  // check interrupt source
	{
		TIM4->CR1 &= ~(1<<0);                      // Disable Timer
    TIM4->SR &= ~(1<<0);                          // clear UIF flag
		// Reset stepping pins (leave the direction pins)
		DoOutPort(0x00,0x02);	//	na piny poslem pohyb
	}
} 
*/

// Reset and clear stepper subsystem variables
void st_reset()
{
  memset(&st, 0, sizeof(st));
  set_step_events_per_minute(MINIMUM_STEPS_PER_MINUTE);
  current_block = NULL;
  busy = false;
}

// Initialize and start the stepper motor subsystem
void st_init()
{
//		EXTI_InitTypeDef   EXTI_InitStructure;
		NVIC_InitTypeDef   NVIC_InitStructure;
	
    RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;                     // enable clock for TIM2

		TIM2->PSC = 0;                            // set prescaler
		TIM2->ARR = 1000;												  // set auto-reload
		TIM2->CR1 = 0;                            // reset command register 1
		TIM2->CR2 = 0;                            // reset command register 2
		TIM2->DIER = (1<<0);                      // Update interrupt enabled
		TIM2->CR1 |= (1<<0);                      // Enable Timer


		NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;			     		//选择定时器2中断线
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;		 //抢占优先级为1
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;			 		//响应优先级为0
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				 			//使能中断通道
		NVIC_Init(&NVIC_InitStructure);								 
		
//		DoOutPort(0,0x03);	
//		GPIO_EXTILineConfig(GPIO_PortSourceGPIOE, GPIO_PinSource4);
//		EXTI_InitStructure.EXTI_Line = EXTI_Line4;
//		EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
//		EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
//		EXTI_InitStructure.EXTI_LineCmd = ENABLE;
//		EXTI_Init(&EXTI_InitStructure);

//		NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
//		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
//		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
//		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

//		NVIC_Init(&NVIC_InitStructure);
//		NVIC_SetPriority(EXTI4_IRQn, 3);


  st_wake_up();
  st_go_idle();
}

// Configures the prescaler and ceiling of timer 1 to produce the given rate as accurately as possible.
// Returns the actual number of cycles per interrupt
static uint32_t config_step_timer(uint32_t cycles)
{
  uint16_t ceiling;
  uint16_t prescaler;
  uint32_t actual_cycles;
  if (cycles <= 0xffffL) {
    ceiling = cycles;
    prescaler = 4; // prescaler: 0
    actual_cycles = ceiling;
  } else if (cycles <= 0x7ffffL) {
    ceiling = cycles >> 3;
    prescaler = 8; // prescaler: 8
    actual_cycles = ceiling * 8L;
  } else if (cycles <= 0x3fffffL) {
    ceiling =  cycles >> 6;
    prescaler = 64; // prescaler: 64
    actual_cycles = ceiling * 64L;
  } else if (cycles <= 0xffffffL) {
    ceiling =  (cycles >> 8);
    prescaler = 256; // prescaler: 256
    actual_cycles = ceiling * 256L;
  } else if (cycles <= 0x3ffffffL) {
    ceiling = (cycles >> 10);
    prescaler = 1024; // prescaler: 1024
    actual_cycles = ceiling * 1024L;    
  } else {
    // Okay, that was slower than we actually go. Just set the slowest speed
    ceiling = 0xffff;
    prescaler = 1024;
    actual_cycles = 0xffff * 1024;
  }
	
  // Set prescaler
//  TCCR1B = (TCCR1B & ~(0x07<<CS10)) | (prescaler<<CS10);
  // Set ceiling
//  OCR1A = ceiling;
		TIM2->PSC = prescaler;                      // set prescaler
		TIM2->ARR = ceiling;											  // set auto-reload

  return(actual_cycles);
} 
static void set_step_events_per_minute(uint32_t steps_per_minute) 
{
  if (steps_per_minute < MINIMUM_STEPS_PER_MINUTE) { steps_per_minute = MINIMUM_STEPS_PER_MINUTE; }
  st.cycles_per_step_event = config_step_timer((TICKS_PER_MICROSECOND*1000000*60)/steps_per_minute);
}

// Planner external interface to start stepper interrupt and execute the blocks in queue. Called
// by the main program functions: planner auto-start and run-time command execution.
void st_cycle_start() 
{
  if (sys.state == STATE_QUEUED) {
    sys.state = STATE_CYCLE;
    st_wake_up();
  }
}

// Execute a feed hold with deceleration, only during cycle. Called by main program.
void st_feed_hold() 
{
  if (sys.state == STATE_CYCLE) {
    sys.state = STATE_HOLD;
    sys.auto_start = false; // Disable planner auto start upon feed hold.
  }
}

// Reinitializes the cycle plan and stepper system after a feed hold for a resume. Called by 
// runtime command execution in the main program, ensuring that the planner re-plans safely.
// NOTE: Bresenham algorithm variables are still maintained through both the planner and stepper
// cycle reinitializations. The stepper path should continue exactly as if nothing has happened.
// Only the planner de/ac-celerations profiles and stepper rates have been updated.
void st_cycle_reinitialize()
{
  if (current_block != NULL) {
    // Replan buffer from the feed hold stop location.
    plan_cycle_reinitialize(current_block->step_event_count - st.step_events_completed);
    // Update initial rate and timers after feed hold.
    st.trapezoid_adjusted_rate = 0; // Resumes from rest
    set_step_events_per_minute(st.trapezoid_adjusted_rate);
    st.trapezoid_tick_cycle_counter = CYCLES_PER_ACCELERATION_TICK/2; // Start halfway for midpoint rule.
    st.step_events_completed = 0;
    sys.state = STATE_QUEUED;
  } else {
    sys.state = STATE_IDLE;
  }
}

void EXTI4_IRQHandler(void)
{
  if(EXTI_GetITStatus(EXTI_Line4) != RESET)
	{                        // EXTI0 interrupt pending?
		EXTI_ClearITPendingBit(EXTI_Line4);    // clear pending interrupt
	
//    if((GPIOE->IDR & (1 << 4)) == 0)    //  Stlaceny emergeny vstup
//    {
//				bit_true(sys.execute,EXEC_FEED_HOLD);
////				beep(500);
//				if (GetAbort())
//				{
//					sys.auto_start = 0;
//					sys.abort = 1;
//				}
//    }
		
	}
}
